#В заданный непустой текст входят только цифры и буквы. 
#Определить, удовлетворяет ли он следующему свойству: текст является десятичной записью числа, кратного 9.

import sys

a = input('Введіть текст:')

for i in a:
    if i.isalpha():
        print('Текст не задовільняє задані параметри')
        sys.exit(0)
a = int(a)
if a % 9 == 0:
    print('Текст задовольняє задані властивості')
else:
    print('Текст не задовільняє задані параметри')
